{"modelTopology":{"class_name":"Model","config":{"name":"model2","layers":[{"name":"input3","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"input3"},"inbound_nodes":[]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,100],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":10,"output_dim":100,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input3",0,0,{}]]]},{"name":"multiply_Multiply1","class_name":"Multiply","config":{"name":"multiply_Multiply1","trainable":true},"inbound_nodes":[[["input2",0,0,{}],["embedding_Embedding1",0,0,{}]]]},{"name":"sequential_2","class_name":"Sequential","config":{"name":"sequential_2","layers":[{"class_name":"Dense","config":{"units":3456,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true,"batch_input_shape":[null,100],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[3,3,384],"name":"reshape_Reshape1","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":192,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[1,1],"padding":"valid","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":96,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose2","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":1,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[5,5],"strides":[2,2],"padding":"same","data_format":"channels_last","activation":"tanh","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose3","trainable":true}}]},"inbound_nodes":[[["multiply_Multiply1",0,0,{}]]]}],"input_layers":[["input2",0,0],["input3",0,0]],"output_layers":[["sequential_2",1,0]]},"keras_version":"tfjs-layers 2.8.6","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[10,100],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[100,3456],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[3456],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[5,5,192,384],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[192],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[192],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[192],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/kernel","shape":[5,5,96,192],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/bias","shape":[96],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[96],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[96],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/kernel","shape":[5,5,1,96],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[192],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[192],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[96],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[96],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v2.8.6","convertedBy":null}