{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,12],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"embedding_Embedding1","class_name":"Embedding","config":{"input_dim":35,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":12,"name":"embedding_Embedding1","trainable":true,"batch_input_shape":[null,12]},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"input2","class_name":"InputLayer","config":{"batch_input_shape":[null,10],"dtype":"float32","sparse":false,"name":"input2"},"inbound_nodes":[]},{"name":"lstm_LSTM1","class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["embedding_Embedding1",0,0,{}]]]},{"name":"embedding_Embedding2","class_name":"Embedding","config":{"input_dim":13,"output_dim":64,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":true,"input_length":10,"name":"embedding_Embedding2","trainable":true,"batch_input_shape":[null,10]},"inbound_nodes":[[["input2",0,0,{}]]]},{"name":"encoderLast","class_name":"GetLastTimestepLayer","config":{"name":"encoderLast","trainable":true},"inbound_nodes":[[["lstm_LSTM1",0,0,{}]]]},{"name":"lstm_LSTM2","class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["embedding_Embedding2",0,0,{}],["encoderLast",0,0,{}],["encoderLast",0,0,{}]]]},{"name":"dot_Dot1","class_name":"Dot","config":{"axes":[2,2],"normalize":false,"name":"dot_Dot1","trainable":true},"inbound_nodes":[[["lstm_LSTM2",0,0,{}],["lstm_LSTM1",0,0,{}]]]},{"name":"attention","class_name":"Activation","config":{"activation":"softmax","name":"attention","trainable":true},"inbound_nodes":[[["dot_Dot1",0,0,{}]]]},{"name":"context","class_name":"Dot","config":{"axes":[2,1],"normalize":false,"name":"context","trainable":true},"inbound_nodes":[[["attention",0,0,{}],["lstm_LSTM1",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["context",0,0,{}],["lstm_LSTM2",0,0,{}]]]},{"name":"time_distributed_TimeDistributed1","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":64,"activation":"tanh","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},"name":"time_distributed_TimeDistributed1","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"time_distributed_TimeDistributed2","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":13,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},"name":"time_distributed_TimeDistributed2","trainable":true},"inbound_nodes":[[["time_distributed_TimeDistributed1",0,0,{}]]]}],"input_layers":[["input1",0,0],["input2",0,0]],"output_layers":[["time_distributed_TimeDistributed2",0,0]]},"keras_version":"tfjs-layers 3.0.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"embedding_Embedding1/embeddings","shape":[35,64],"dtype":"float32"},{"name":"lstm_LSTM1/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"embedding_Embedding2/embeddings","shape":[13,64],"dtype":"float32"},{"name":"lstm_LSTM2/kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM2/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM2/bias","shape":[256],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/kernel","shape":[128,64],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/bias","shape":[64],"dtype":"float32"},{"name":"time_distributed_TimeDistributed2/kernel","shape":[64,13],"dtype":"float32"},{"name":"time_distributed_TimeDistributed2/bias","shape":[13],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.0.0","convertedBy":null}